Revit 2024 API
BuiltInFailures.MEPFabricationFailures.FabricationRodDetachFromHangerError Property
 The rod need to be detached from hanger.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId FabricationRodDetachFromHangerError { get; }
Visual Basic
Public Shared ReadOnly Property FabricationRodDetachFromHangerError As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ FabricationRodDetachFromHangerError {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.MEPFabricationFailures Class
Autodesk.Revit.DB Namespace